// smart-material-customer-fronted
// url
const url = /^(https?:\/\/(([a-zA-Z0-9]+-?)+[a-zA-Z0-9]+\.)+[a-zA-Z]+)(:\d+)?(\/.*)?(\?.*)?(#.*)?$/
// 身份证
const id = /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|[Xx])$/
// 手机号
const phone = /^1(3[0-9]|4[01456879]|5[0-35-9]|6[2567]|7[0-8]|8[0-9]|9[0-35-9])\d{8}$/
// 固定电话
const tel = /^(0[0-9]{2,3}-)?([2-9][0-9]{6,7})+(-[0-9]{1,4})?$/
// 邮箱
const email = /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/
// 手机号、座机号
const tel2 = /^1(3[0-9]|4[01456879]|5[0-35-9]|6[2567]|7[0-8]|8[0-9]|9[0-35-9])\d{8}$/
// 不能为负数和小数，最多999999999
const number1 = /(^[0-9]{1,9}$)|(^[0-9]{1,9}[\.]{0}[0-9]{0}$)/
// 仅支持中文、英文和数字
const textAndNumber = /^[A-Za-z\d\u4E00-\u9FA5]+$/
// 支持英文和数字
const enAndNumber = /^[A-Za-z\d]+$/
// 8-18位数字和字母
const enAndNumber2 = /^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{8,18}$/
// 7位整数，保留两位小数
const number3 = /^\d{0,7}(\.\d{0,2})?$/

// mixed-om-organization
// 只能输入中、英文
const pattern1 = /^([a-zA-Z]|[\u4E00-\u9FA5]|\s)*$/
// 8-24个字符，需要同时包含大写字母、小写字母、数字
const number4 = /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z]).{8,24}$/
// 18位数字或大写字母
const number5 = /^[0-9A-Z]{18}$/

// client-organization
// 必须包含字母、数字,且大于7位
const number6 = /(?=.*[0-9])(?=.*[a-zA-Z]).{8,30}/

// aigang
// ipv4
const ip = /^127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$/